Revit 2027 API
ShapeImporter.SetDefaultLengthUnit Method
 Sets the length unit to be used when the input is a unitless SAT file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ShapeImporter SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
Public Function SetDefaultLengthUnit (
	defaultLengthUnit As ImportUnit
) As ShapeImporter
public:
ShapeImporter^ SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
member SetDefaultLengthUnit :
        defaultLengthUnit : ImportUnit -> ShapeImporter
Parameters
defaultLengthUnit ImportUnit
 The length unit to be used for when the input is a unitless SAT file.
Return Value
ShapeImporter
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace